{
    "sorting": {
        "bubble": {
            "title": "Bubble Sort",
            "avgTimeComplexity": "O(n²)",
            "description": "Bubble sort is a simple sorting algorithm. The algorithm starts at the beginning of the data set. It compares the first two elements, and if the first is greater than the second, it swaps them. It continues doing this for each pair of adjacent elements to the end of the data set. It then starts again with the first two elements, repeating until no swaps have occurred on the last pass. This algorithm's average time and worst-case performance is O(n2), so it is rarely used to sort large, unordered data sets. Bubble sort can be used to sort a small number of items (where its asymptotic inefficiency is not a high penalty). Bubble sort can also be used efficiently on a list of any length that is nearly sorted (that is, the elements are not significantly out of place). For example, if any number of elements are out of place by only one position (e.g. 0123546789 and 1032547698), bubble sort's exchange will get them in order on the first pass, the second pass will find all elements in order, so the sort will take only 2n time."
        },
        "selection": {
            "title": "Selection Sort",
            "avgTimeComplexity": "O(n²)",
            "description": "Selection sort is an in-place comparison sort. It has O(n2) complexity, making it inefficient on large lists, and generally performs worse than the similar insertion sort. Selection sort is noted for its simplicity, and also has performance advantages over more complicated algorithms in certain situations. \n  The algorithm finds the minimum value, swaps it with the value in the first position, and repeats these steps for the remainder of the list. It does no more than n swaps, and thus is useful where swapping is very expensive."
            
        },
        "insertion": {
            "title": "Insertion Sort",
            "avgTimeComplexity": "O(n²)",
            "description": "Insertion sort is a simple sorting algorithm that is relatively efficient for small lists and mostly sorted lists, and is often used as part of more sophisticated algorithms. It works by taking elements from the list one by one and inserting them in their correct position into a new sorted list similar to how we put money in our wallet.In arrays, the new list and the remaining elements can share the array's space, but insertion is expensive, requiring shifting all following elements over by one. Shellsort is a variant of insertion sort that is more efficient for larger lists."
        },
        "quick": {
            "title": "Quick Sort",
            "avgTimeComplexity": "O(n log n)",
            "description": ""
        },
        "heap": {
            "title": "Heap Sort",
            "avgTimeComplexity": "O(n log n)",
            "description": ""
        },
        "merge": {
            "title": "Merge Sort",
            "avgTimeComplexity": "O(n log n)",
            "description": ""
        }
    }
    
}